{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_first_conv_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_0", 
      "attrs": {"with_bn": "true"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 1], [5, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_first_conv_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_first_conv_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "16", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0__plusscalar0", 
      "attrs": {"scalar": "3"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0_hard_swish", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0__divscalar0", 
      "attrs": {"scalar": "6.0"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0__mul0", 
      "inputs": [[6, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_1", 
      "attrs": {"with_bn": "true"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0__mul0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv3_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv3_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "16", 
                "num_group": "16", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm3_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_2", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 1], [21, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv4_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv4_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "16", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm4_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_relu2_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_3", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[10, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_hardswish0__mul0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "57", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(57,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_4", 
      "attrs": {"with_bn": "true"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 1], [33, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "57", 
                "num_group": "57", 
                "pad": "(1, 1)", 
                "stride": "(2, 2)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 57, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_5", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "48", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Concat", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[22, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_reshape0", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_swapaxes0", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_reshape1", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_slice0", 
      "attrs": {
        "begin": "(None, None, None, None)", 
        "end": "(None, 32, None, None)"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_slice1", 
      "attrs": {
        "begin": "(None, 32, None, None)", 
        "end": "(None, None, None, None)"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51, 32, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_6", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 1], [51, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_shufflechannels0_slice1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "51", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(51,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_7", 
      "attrs": {"with_bn": "true"}, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_act_6_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv1_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "51", 
                "num_group": "51", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm1_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10], 
          "heads": [[7, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 51, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_8", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_7_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_conv2_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "32", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_batchnorm2_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_relu1_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Concat", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock1_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[45, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_reshape0", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_swapaxes0", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_reshape1", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_slice0", 
      "attrs": {
        "begin": "(None, None, None, None)", 
        "end": "(None, 32, None, None)"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_slice1", 
      "attrs": {
        "begin": "(None, 32, None, None)", 
        "end": "(None, None, None, None)"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44, 32, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_act_9", 
      "attrs": {
        "with_act": "true", 
        "with_bn": "true"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 1], [75, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_shufflechannels0_slice1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_conv0_fwd", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "layout": "NCHW", 
                "no_bias": "True", 
                "num_filter": "44", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_running_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_running_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm0_fwd", 
              "attrs": {
                "axis": "1", 
                "eps": "1e-05", 
                "fix_gamma": "False", 
                "momentum": "0.1", 
                "use_global_stats": "False"
              }, 
              "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_relu0_fwd", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[7, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 3, 4, 5, 6], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 10, 11], 
          "heads": [[8, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shufflenasoneshotfix0_hybridsequential0_shufflenetblock2_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(44,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
